In [1]:
!pip install fastapi
!pip install uvicorn
!pip install python-dotenv
!pip install sqlalchemy
!pip install cachetools
!pip install pandas

Requirement already satisfied: fastapi in /root/LLMBitlink/myenv/lib/python3.12/site-packages (0.115.6)
Requirement already satisfied: starlette<0.42.0,>=0.40.0 in /root/LLMBitlink/myenv/lib/python3.12/site-packages (from fastapi) (0.41.3)
Requirement already satisfied: pydantic!=1.8,!=1.8.1,!=2.0.0,!=2.0.1,!=2.1.0,<3.0.0,>=1.7.4 in /root/LLMBitlink/myenv/lib/python3.12/site-packages (from fastapi) (2.7.1)
Requirement already satisfied: typing-extensions>=4.8.0 in /root/LLMBitlink/myenv/lib/python3.12/site-packages (from fastapi) (4.11.0)
Requirement already satisfied: annotated-types>=0.4.0 in /root/LLMBitlink/myenv/lib/python3.12/site-packages (from pydantic!=1.8,!=1.8.1,!=2.0.0,!=2.0.1,!=2.1.0,<3.0.0,>=1.7.4->fastapi) (0.6.0)
Requirement already satisfied: pydantic-core==2.18.2 in /root/LLMBitlink/myenv/lib/python3.12/site-packages (from pydantic!=1.8,!=1.8.1,!=2.0.0,!=2.0.1,!=2.1.0,<3.0.0,>=1.7.4->fastapi) (2.18.2)
Requirement already satisfied: anyio<5,>=3.4.0 in /root/LLMBitlink/myenv/lib/python3.12/site-packages (from starlette<0.42.0,>=0.40.0->fastapi) (4.3.0)
Requirement already satisfied: idna>=2.8 in /root/LLMBitlink/myenv/lib/python3.12/site-packages (from anyio<5,>=3.4.0->starlette<0.42.0,>=0.40.0->fastapi) (3.7)
Requirement already satisfied: sniffio>=1.1 in /root/LLMBitlink/myenv/lib/python3.12/site-packages (from anyio<5,>=3.4.0->starlette<0.42.0,>=0.40.0->fastapi) (1.3.1)
Requirement already satisfied: uvicorn in /root/LLMBitlink/myenv/lib/python3.12/site-packages (0.32.1)
Requirement already satisfied: click>=7.0 in /root/LLMBitlink/myenv/lib/python3.12/site-packages (from uvicorn) (8.1.7)
Requirement already satisfied: h11>=0.8 in /root/LLMBitlink/myenv/lib/python3.12/site-packages (from uvicorn) (0.14.0)
Requirement already satisfied: python-dotenv in /root/LLMBitlink/myenv/lib/python3.12/site-packages (1.0.1)
Requirement already satisfied: sqlalchemy in /root/LLMBitlink/myenv/lib/python3.12/site-packages (2.0.36)
Requirement already satisfied: typing-extensions>=4.6.0 in /root/LLMBitlink/myenv/lib/python3.12/site-packages (from sqlalchemy) (4.11.0)
Requirement already satisfied: greenlet!=0.4.17 in /root/LLMBitlink/myenv/lib/python3.12/site-packages (from sqlalchemy) (3.1.1)
Requirement already satisfied: cachetools in /root/LLMBitlink/myenv/lib/python3.12/site-packages (5.5.0)
Requirement already satisfied: pandas in /root/LLMBitlink/myenv/lib/python3.12/site-packages (2.2.3)
Requirement already satisfied: numpy>=1.26.0 in /root/LLMBitlink/myenv/lib/python3.12/site-packages (from pandas) (2.1.3)
Requirement already satisfied: python-dateutil>=2.8.2 in /root/LLMBitlink/myenv/lib/python3.12/site-packages (from pandas) (2.9.0.post0)
Requirement already satisfied: pytz>=2020.1 in /root/LLMBitlink/myenv/lib/python3.12/site-packages (from pandas) (2024.2)
Requirement already satisfied: tzdata>=2022.7 in /root/LLMBitlink/myenv/lib/python3.12/site-packages (from pandas) (2024.2)
Requirement already satisfied: six>=1.5 in /root/LLMBitlink/myenv/lib/python3.12/site-packages (from python-dateutil>=2.8.2->pandas) (1.17.0)

In [3]:
import sqlite3
import pandas as pd
from pathlib import Path
import os
from IPython.display import display, HTML

In [4]:
class DatabaseViewer:
    def __init__(self, db_path):
        self.conn = sqlite3.connect(db_path)
        self.cursor = self.conn.cursor()
    
    def get_tables(self):
        self.cursor.execute("""
            SELECT name 
            FROM sqlite_master 
            WHERE type='table' 
            AND name NOT LIKE 'sqlite_%';
        """)
        return [table[0] for table in self.cursor.fetchall()]
    
    def get_table_info(self, table_name):
        self.cursor.execute(f"PRAGMA table_info({table_name});")
        columns = self.cursor.fetchall()
        self.cursor.execute(f"SELECT COUNT(*) FROM {table_name};")
        row_count = self.cursor.fetchone()[0]
        
        return {
            'columns': pd.DataFrame(columns, columns=['cid', 'name', 'type', 'notnull', 'dflt_value', 'pk']),
            'row_count': row_count
        }
    
    def query_table(self, table_name, limit=5):
        try:
            return pd.read_sql_query(f"SELECT * FROM {table_name} LIMIT {limit}", self.conn)
        except Exception as e:
            return f"Error querying table {table_name}: {str(e)}"
    
    def display_database_info(self):
        tables = self.get_tables()
        print(f"üìä Total Tables: {len(tables)}\n")
        
        for table in tables:
            info = self.get_table_info(table)
            print(f"\nüóÉÔ∏è Table: {table}")
            print(f"   Rows: {info['row_count']}")
            print("\nüìã Schema:")
            display(info['columns'])
            print("\nüìù Sample Data:")
            display(self.query_table(table))
            print("-" * 80)
    
    def execute_custom_query(self, query):
        try:
            return pd.read_sql_query(query, self.conn)
        except Exception as e:
            return f"Query error: {str(e)}"
    
    def execute_update_query(self, query):
        try:
            self.cursor.execute(query)
            self.conn.commit()  # Importante: commit los cambios
            return "Update executed successfully"
        except Exception as e:
            self.conn.rollback()  # En caso de error, hacer rollback
            return f"Update error: {str(e)}"
    
    def close(self):
        self.conn.close()

In [5]:
db_path = "../../chat-Interface/db.sqlite3"
viewer = DatabaseViewer(db_path)

In [6]:
viewer.display_database_info()

üìä Total Tables: 17


üóÉÔ∏è Table: django_migrations
   Rows: 23

üìã Schema:

   cid     name          type  notnull dflt_value  pk
0    0       id       INTEGER        1       None   1
1    1      app  varchar(255)        1       None   0
2    2     name  varchar(255)        1       None   0
3    3  applied      datetime        1       None   0

üìù Sample Data:

,id,app,name,applied
0,1,contenttypes,0001_initial,2024-09-26 21:20:14.671169
1,2,auth,0001_initial,2024-09-26 21:20:14.725782
2,3,admin,0001_initial,2024-09-26 21:20:14.778684
3,4,admin,0002_logentry_remove_auto_add,2024-09-26 21:20:14.820878
4,5,admin,0003_logentry_add_action_flag_choices,2024-09-26 21:20:14.875153

--------------------------------------------------------------------------------

üóÉÔ∏è Table: auth_group_permissions
   Rows: 0

üìã Schema:

   cid           name     type  notnull dflt_value  pk
0    0             id  INTEGER        1       None   1
1    1       group_id  INTEGER        1       None   0
2    2  permission_id  INTEGER        1       None   0

üìù Sample Data:

Empty DataFrame
Columns: [id, group_id, permission_id]
Index: []

--------------------------------------------------------------------------------

üóÉÔ∏è Table: auth_user_groups
   Rows: 0

üìã Schema:

   cid      name     type  notnull dflt_value  pk
0    0        id  INTEGER        1       None   1
1    1   user_id  INTEGER        1       None   0
2    2  group_id  INTEGER        1       None   0

üìù Sample Data:

Empty DataFrame
Columns: [id, user_id, group_id]
Index: []

--------------------------------------------------------------------------------

üóÉÔ∏è Table: auth_user_user_permissions
   Rows: 0

üìã Schema:

   cid           name     type  notnull dflt_value  pk
0    0             id  INTEGER        1       None   1
1    1        user_id  INTEGER        1       None   0
2    2  permission_id  INTEGER        1       None   0

üìù Sample Data:

Empty DataFrame
Columns: [id, user_id, permission_id]
Index: []

--------------------------------------------------------------------------------

üóÉÔ∏è Table: django_admin_log
   Rows: 350

üìã Schema:

   cid             name               type  notnull dflt_value  pk
0    0               id            INTEGER        1       None   1
1    1      action_time           datetime        1       None   0
2    2        object_id               TEXT        0       None   0
3    3      object_repr       varchar(200)        1       None   0
4    4   change_message               TEXT        1       None   0
5    5  content_type_id            INTEGER        0       None   0
6    6          user_id            INTEGER        1       None   0
7    7      action_flag  smallint unsigned        1       None   0

üìù Sample Data:

,id,action_time,object_id,object_repr,change_message,content_type_id,user_id,action_flag
0,1,2024-10-23 22:45:03.717089,1,Apartment en Mar de Plata - 150000 USD,"[{""added"": {}}]",9,3,1
1,2,2024-10-23 22:47:58.779279,2,Apartment en Mar de Plata - 450000 USD,"[{""added"": {}}]",9,3,1
2,3,2024-10-23 22:50:25.348339,3,Apartment en Buenos Aires - 340000 USD,"[{""added"": {}}]",9,3,1
3,4,2024-10-23 23:09:12.576179,4,Cabin en VIllavicencio - 100000 USD,"[{""added"": {}}]",9,3,1
4,5,2024-10-23 23:09:25.099530,4,Cabin en VIllavicencio - 100000.00 USD,[],9,3,2

--------------------------------------------------------------------------------

üóÉÔ∏è Table: django_content_type
   Rows: 13

üìã Schema:

   cid       name          type  notnull dflt_value  pk
0    0         id       INTEGER        1       None   1
1    1  app_label  varchar(100)        1       None   0
2    2      model  varchar(100)        1       None   0

üìù Sample Data:

   id app_label         model
0   1      chat         chunk
1   2      chat  conversation
2   3     admin      logentry
3   4      auth    permission
4   5      auth         group

--------------------------------------------------------------------------------

üóÉÔ∏è Table: auth_permission
   Rows: 52

üìã Schema:

   cid             name          type  notnull dflt_value  pk
0    0               id       INTEGER        1       None   1
1    1  content_type_id       INTEGER        1       None   0
2    2         codename  varchar(100)        1       None   0
3    3             name  varchar(255)        1       None   0

üìù Sample Data:

   id  content_type_id          codename                  name
0   1                1         add_chunk         Can add chunk
1   2                1      change_chunk      Can change chunk
2   3                1      delete_chunk      Can delete chunk
3   4                1        view_chunk        Can view chunk
4   5                2  add_conversation  Can add conversation

--------------------------------------------------------------------------------

üóÉÔ∏è Table: auth_group
   Rows: 0

üìã Schema:

   cid  name          type  notnull dflt_value  pk
0    0    id       INTEGER        1       None   1
1    1  name  varchar(150)        1       None   0

üìù Sample Data:

Empty DataFrame
Columns: [id, name]
Index: []

--------------------------------------------------------------------------------

üóÉÔ∏è Table: auth_user
   Rows: 6

üìã Schema:

    cid          name          type  notnull dflt_value  pk
0     0            id       INTEGER        1       None   1
1     1      password  varchar(128)        1       None   0
2     2    last_login      datetime        0       None   0
3     3  is_superuser          bool        1       None   0
4     4      username  varchar(150)        1       None   0
5     5     last_name  varchar(150)        1       None   0
6     6         email  varchar(254)        1       None   0
7     7      is_staff          bool        1       None   0
8     8     is_active          bool        1       None   0
9     9   date_joined      datetime        1       None   0
10   10    first_name  varchar(150)        1       None   0

üìù Sample Data:

,id,password,last_login,is_superuser,username,last_name,email,is_staff,is_active,date_joined,first_name
0,1,pbkdf2_sha256$260000$7eFXuVoDtAS37tH2K97eKu$gR...,None,0,pedroelias,,pedro@gmail.com,0,1,2024-09-26 21:44:53.236176,
1,2,pbkdf2_sha256$260000$aqPTVsK2aKSBLIAyQe2mbH$JW...,2024-10-24 13:36:44.341907,0,pedro,,pedroelias@gmail.com,0,1,2024-09-26 21:46:19.020400,
2,3,pbkdf2_sha256$260000$urag7rvKcYgxTQyQgyQLi7$0j...,2024-12-10 16:33:07.325013,1,jorge,,jorge@gmail.com,1,1,2024-09-27 23:18:31.275827,
3,4,pbkdf2_sha256$260000$R9orms3dQrIbhafmv27xaB$Wm...,2024-10-14 16:12:25.301971,1,pedro1,,pedro1@gmail.com,1,1,2024-10-14 16:12:13.621990,
4,5,pbkdf2_sha256$260000$vU7JVM54Jpee5c32O9bT3A$p3...,2024-12-10 15:59:39.338953,0,saul,,sauleduardo1111@gmail.com,0,1,2024-12-10 15:59:27.795082,

--------------------------------------------------------------------------------

üóÉÔ∏è Table: chat_chunk
   Rows: 0

üìã Schema:

   cid         name     type  notnull dflt_value  pk
0    0           id  INTEGER        1       None   1
1    1  document_id  INTEGER        1       None   0
2    2      content     TEXT        1       None   0
3    3    embedding     TEXT        1       None   0

üìù Sample Data:

Empty DataFrame
Columns: [id, document_id, content, embedding]
Index: []

--------------------------------------------------------------------------------

üóÉÔ∏è Table: chat_conversation
   Rows: 0

üìã Schema:

   cid       name      type  notnull dflt_value  pk
0    0         id   INTEGER        1       None   1
1    1      input      TEXT        1       None   0
2    2     output      TEXT        1       None   0
3    3  timestamp  datetime        1       None   0
4    4    user_id   INTEGER        1       None   0

üìù Sample Data:

Empty DataFrame
Columns: [id, input, output, timestamp, user_id]
Index: []

--------------------------------------------------------------------------------

üóÉÔ∏è Table: django_session
   Rows: 16

üìã Schema:

   cid          name         type  notnull dflt_value  pk
0    0   session_key  varchar(40)        1       None   1
1    1  session_data         TEXT        1       None   0
2    2   expire_date     datetime        1       None   0

üìù Sample Data:

,session_key,session_data,expire_date
0,6bmt1wlj41tkvd4nrwncwydodmyfjhet,.eJxVjMsOwiAQRf-FtSEUZgLj0r3fQHgMUjWQlHZl_Hdt0...,2024-10-11 23:18:50.458878
1,3wwts7w6vbgi25vkai9m6b8edd7ioeft,.eJxVjDsOwjAQBe_iGlnrjX-hpOcM1npt4wBypDipEHeHS...,2024-10-28 16:12:25.334381
2,0w5ta1bwjyu5g8djinreamsxd5xzfv40,.eJxVjMsOwiAQRf-FtSEUZgLj0r3fQHgMUjWQlHZl_Hdt0...,2024-11-06 22:36:32.638397
3,liqm9t9i5znr7uzuem36w45cdbdybl55,.eJxVjMsOwiAQRf-FtSEUZgLj0r3fQHgMUjWQlHZl_Hdt0...,2024-11-06 22:38:35.646551
4,fp271r9hfq7tw0jo7mpt5soq90awfwjs,.eJxVjMsOwiAQRf-FtSEUZgLj0r3fQHgMUjWQlHZl_Hdt0...,2024-11-06 23:40:29.533622

--------------------------------------------------------------------------------

üóÉÔ∏è Table: chat_country
   Rows: 6

üìã Schema:

   cid  name          type  notnull dflt_value  pk
0    0    id       INTEGER        1       None   1
1    1  name  varchar(100)        1       None   0

üìù Sample Data:

   id                             name
0   1  Ciudad Autonoma de Buenos Aires
1   2                        Argentina
2   3                         Colombia
3   4                             Peru
4   5                        Venezuela

--------------------------------------------------------------------------------

üóÉÔ∏è Table: chat_finanzas
   Rows: 0

üìã Schema:

   cid                      name         type  notnull dflt_value  pk
0    0                        id      INTEGER        1       None   1
1    1  planes_de_financiamiento  varchar(20)        1       None   0
2    2         tipo_de_inversion  varchar(20)        1       None   0
3    3            tipo_de_moneda  varchar(10)        1       None   0

üìù Sample Data:

Empty DataFrame
Columns: [id, planes_de_financiamiento, tipo_de_inversion, tipo_de_moneda]
Index: []

--------------------------------------------------------------------------------

üóÉÔ∏è Table: chat_province
   Rows: 6

üìã Schema:

   cid        name          type  notnull dflt_value  pk
0    0          id       INTEGER        1       None   1
1    1        name  varchar(100)        1       None   0
2    2  country_id        bigint        1       None   0

üìù Sample Data:

   id             name  country_id
0   5          Rosario           5
1   6             Lima           4
2   7          Quindio           3
3   8        Antioqu√≠a           3
4   9  Capital Federal           2

--------------------------------------------------------------------------------

üóÉÔ∏è Table: chat_city
   Rows: 9

üìã Schema:

   cid         name          type  notnull dflt_value  pk
0    0           id       INTEGER        1       None   1
1    1         name  varchar(100)        1       None   0
2    2  province_id        bigint        1       None   0

üìù Sample Data:

   id           name  province_id
0   1       Recoleta            9
1   2        Palermo            9
2   3  Villa Urquiza            9
3   4       Envigado            8
4   5        Armenia            7

--------------------------------------------------------------------------------

üóÉÔ∏è Table: chat_property
   Rows: 9

üìã Schema:

    cid              name          type  notnull dflt_value  pk
0     0                id       INTEGER        1       None   1
1     1          location  varchar(255)        1       None   0
2     2             price       decimal        1       None   0
3     3     square_meters       decimal        1       None   0
4     4     property_type   varchar(20)        1       None   0
5     5       description          TEXT        0       None   0
6     6        created_at      datetime        1       None   0
7     7      num_bedrooms       INTEGER        1       None   0
8     8         num_rooms       INTEGER        1       None   0
9     9  project_category   varchar(20)        1       None   0
10   10      project_type   varchar(20)        1       None   0
11   11    residence_type   varchar(20)        1       None   0
12   12           city_id        bigint        0       None   0
13   13        country_id        bigint        0       None   0
14   14       province_id        bigint        0       None   0
15   15             image  varchar(100)        0       None   0
16   16               url  varchar(255)        0       None   0

üìù Sample Data:

,id,location,price,square_meters,property_type,description,created_at,num_bedrooms,num_rooms,project_category,project_type,residence_type,city_id,country_id,province_id,image,url
0,18,"Palermo, Capital Federal",225000,150.00,apartment,Amplio y Luminoso PH Con gran terraza en excel...,2024-12-10 15:07:02.523933,6,8,premium,pozo,familiar,None,2,None,property_images/casa2.jpeg,https://cabaprop.com.ar/propiedad/67584b50fef2...
1,19,"Villa Urquiza, Capital Federal",137000,53.00,apartment,Vendo en VILLA URQUIZA\r\n\r\n*APTO CREDITO*\r...,2024-12-10 15:09:52.913019,2,4,premium,no_pozo,unipersonal,None,2,None,property_images/apto2.jpeg,https://cabaprop.com.ar/propiedad/64d0a347d7bb...
2,20,"Envigado, Antioqu√≠a",370000,73.99,apartment,"Vivir en Civita es vivir urbano, es sentir la ...",2024-12-10 15:30:53.700602,3,6,social,pozo,familiar,None,3,None,,https://www.estrenarvivienda.com/civita/47125
3,21,"Armenia, Quindio",54000,43.52,apartment,Los apartamentos de Solterra cuentan con sala ...,2024-12-10 15:32:42.704242,1,2,premium,pozo,unipersonal,None,3,None,property_images/col2.jpg,https://www.estrenarvivienda.com/solterra/47301
4,22,"La Planicie 3era Etapa, La Molina, Lima",365000,285.00,house,Casa de 3 pisos con 3 terrazas y excelentes ac...,2024-12-10 15:35:49.272373,3,9,luxury,pozo,familiar,None,4,None,property_images/pe1.jpeg,https://babilonia.pe/inmueble/casa-en-venta-en...

--------------------------------------------------------------------------------

In [7]:
# Consultas personalizadas
print('\nConsulta personalizada:')
query = """
SELECT name, sql 
FROM sqlite_master 
WHERE type='table' 
AND name NOT LIKE 'sqlite_%';
"""
display(viewer.execute_custom_query(query))

# Cerrar conexi√≥n
# viewer.close()

Consulta personalizada:

,name,sql
0,django_migrations,"CREATE TABLE ""django_migrations"" (""id"" integer..."
1,auth_group_permissions,"CREATE TABLE ""auth_group_permissions"" (""id"" in..."
2,auth_user_groups,"CREATE TABLE ""auth_user_groups"" (""id"" integer ..."
3,auth_user_user_permissions,"CREATE TABLE ""auth_user_user_permissions"" (""id..."
4,django_admin_log,"CREATE TABLE ""django_admin_log"" (""id"" integer ..."
5,django_content_type,"CREATE TABLE ""django_content_type"" (""id"" integ..."
6,auth_permission,"CREATE TABLE ""auth_permission"" (""id"" integer N..."
7,auth_group,"CREATE TABLE ""auth_group"" (""id"" integer NOT NU..."
8,auth_user,"CREATE TABLE ""auth_user"" (""id"" integer NOT NUL..."
9,chat_chunk,"CREATE TABLE ""chat_chunk"" (""id"" integer NOT NU..."
10,chat_conversation,"CREATE TABLE ""chat_conversation"" (""id"" integer..."
11,django_session,"CREATE TABLE ""django_session"" (""session_key"" v..."
12,chat_country,"CREATE TABLE ""chat_country"" (""id"" integer NOT ..."
13,chat_finanzas,"CREATE TABLE ""chat_finanzas"" (""id"" integer NOT..."
14,chat_province,"CREATE TABLE ""chat_province"" (""id"" integer NOT..."
15,chat_city,"CREATE TABLE ""chat_city"" (""id"" integer NOT NUL..."
16,chat_property,"CREATE TABLE ""chat_property"" (""id"" integer NOT..."

In [13]:
# 1. An√°lisis por Pa√≠s
query_by_country = """
SELECT country_id, 
       COUNT(*) as total_properties,
       AVG(price) as avg_price,
       AVG(square_meters) as avg_size
FROM chat_property
GROUP BY country_id
ORDER BY total_properties DESC;
"""

# 2. An√°lisis por tipo de propiedad
query_price_by_type = """
SELECT property_type,
       COUNT(*) as count,
       AVG(price) as avg_price,
       MIN(price) as min_price,
       MAX(price) as max_price
FROM chat_property
GROUP BY property_type
ORDER BY avg_price DESC;
"""

# 3. Tendencia temporal
query_price_trend = """
SELECT strftime('%Y-%m', created_at) as month,
       COUNT(*) as listings,
       AVG(price) as avg_price,
       AVG(square_meters) as avg_size
FROM chat_property
GROUP BY month
ORDER BY month;
"""

# 4. An√°lisis por ubicaci√≥n
query_location_stats = """
SELECT province_id, city_id,
       COUNT(*) as total_properties,
       AVG(price) as avg_price,
       AVG(price/square_meters) as price_per_sqm
FROM chat_property
GROUP BY province_id, city_id
ORDER BY avg_price DESC;
"""

# 5. Distribuci√≥n por tipo
query_property_distribution = """
SELECT project_type,
       residence_type,
       COUNT(*) as count,
       AVG(price) as avg_price,
       AVG(square_meters) as avg_size
FROM chat_property
GROUP BY project_type, residence_type
ORDER BY count DESC;
"""

# 6. An√°lisis de habitaciones
query_rooms_analysis = """
SELECT num_bedrooms,
       COUNT(*) as count,
       AVG(price) as avg_price,
       AVG(square_meters) as avg_size,
       AVG(price/square_meters) as price_per_sqm
FROM chat_property
GROUP BY num_bedrooms
ORDER BY num_bedrooms;
"""

In [14]:

def run_analysis(viewer):
    queries = {
        "An√°lisis por Pa√≠s": query_by_country,
        "An√°lisis por Tipo": query_price_by_type,
        "Tendencia Temporal": query_price_trend,
        "An√°lisis por Ubicaci√≥n": query_location_stats,
        "Distribuci√≥n por Tipo": query_property_distribution,
        "An√°lisis de Habitaciones": query_rooms_analysis
    }
    
    for title, query in queries.items():
        print(f"\n=== {title} ===")
        result = viewer.execute_custom_query(query)
        display(result)
        print("-"*80)

In [15]:

# Uso:
run_analysis(viewer)

=== An√°lisis por Pa√≠s ===

  country_id  total_properties  avg_price    avg_size
0       None                 6   265000.0  158.833333

--------------------------------------------------------------------------------

=== An√°lisis por Tipo ===

  property_type  count  avg_price  min_price  max_price
0     apartment      5   298000.0      50000     500000
1         cabin      1   100000.0     100000     100000

--------------------------------------------------------------------------------

=== Tendencia Temporal ===

     month  listings  avg_price    avg_size
0  2024-10         6   265000.0  158.833333

--------------------------------------------------------------------------------

=== An√°lisis por Ubicaci√≥n ===

  province_id city_id  total_properties  avg_price  price_per_sqm
0        None    None                 6   265000.0    1965.666667

--------------------------------------------------------------------------------

=== Distribuci√≥n por Tipo ===

  project_type residence_type  count  avg_price  avg_size
0            1              1      5   308000.0     170.6
1         pozo       familiar      1    50000.0     100.0

--------------------------------------------------------------------------------

=== An√°lisis de Habitaciones ===

   num_bedrooms  count  avg_price    avg_size  price_per_sqm
0             1      6   265000.0  158.833333    1965.666667

--------------------------------------------------------------------------------

In [12]:
# Consulta para ver todas las tablas
query = """
SELECT name 
FROM sqlite_master 
WHERE type='table' 
AND name NOT LIKE 'sqlite_%';
"""

# Ver la estructura de las tablas
print("Tablas en la base de datos:")
display(viewer.execute_custom_query(query))

Tablas en la base de datos:

                          name
0            django_migrations
1       auth_group_permissions
2             auth_user_groups
3   auth_user_user_permissions
4             django_admin_log
5          django_content_type
6              auth_permission
7                   auth_group
8                    auth_user
9                   chat_chunk
10           chat_conversation
11              django_session
12                chat_country
13               chat_finanzas
14               chat_province
15                   chat_city
16               chat_property

In [7]:
# Consulta para ver todas las tablas
query = """
SELECT cp.*,
                        ROUND(cp.price, 2) as price,
                        cc.name as country_name,
                        cd.name as province_name,
                        cct.name as city_name
                    FROM chat_property cp
                    LEFT JOIN chat_country cc ON cp.country_id = cc.id
                    LEFT JOIN chat_province cd ON cp.province_id = cd.id
                    LEFT JOIN chat_city cct ON cp.city_id = cct.id
                    ;
"""

# Ver la estructura de las tablas
print("Tablas en la base de datos:")
display(viewer.execute_custom_query(query))

Tablas en la base de datos:

,id,location,price,square_meters,property_type,description,created_at,num_bedrooms,num_rooms,project_category,...,residence_type,city_id,country_id,province_id,image,url,price,country_name,province_name,city_name
0,18,"Palermo, Capital Federal",225000,150.00,apartment,Amplio y Luminoso PH Con gran terraza en excel...,2024-12-10 15:07:02.523933,6,8,premium,...,familiar,None,2,None,property_images/casa2.jpeg,https://cabaprop.com.ar/propiedad/67584b50fef2...,225000.0,Argentina,None,None
1,19,"Villa Urquiza, Capital Federal",137000,53.00,apartment,Vendo en VILLA URQUIZA\r\n\r\n*APTO CREDITO*\r...,2024-12-10 15:09:52.913019,2,4,premium,...,unipersonal,None,2,None,property_images/apto2.jpeg,https://cabaprop.com.ar/propiedad/64d0a347d7bb...,137000.0,Argentina,None,None
2,20,"Envigado, Antioqu√≠a",370000,73.99,apartment,"Vivir en Civita es vivir urbano, es sentir la ...",2024-12-10 15:30:53.700602,3,6,social,...,familiar,None,3,None,,https://www.estrenarvivienda.com/civita/47125,370000.0,Colombia,None,None
3,21,"Armenia, Quindio",54000,43.52,apartment,Los apartamentos de Solterra cuentan con sala ...,2024-12-10 15:32:42.704242,1,2,premium,...,unipersonal,None,3,None,property_images/col2.jpg,https://www.estrenarvivienda.com/solterra/47301,54000.0,Colombia,None,None
4,22,"La Planicie 3era Etapa, La Molina, Lima",365000,285.00,house,Casa de 3 pisos con 3 terrazas y excelentes ac...,2024-12-10 15:35:49.272373,3,9,luxury,...,familiar,None,4,None,property_images/pe1.jpeg,https://babilonia.pe/inmueble/casa-en-venta-en...,365000.0,Peru,None,None
5,23,"Alt. Del Cruce De Acapulco Con Rapallo, La Mol...",555000,404.00,house,Casa de dos pisos rodeada de √°reas verdes 404 ...,2024-12-10 15:39:16.732483,3,10,social,...,familiar,None,4,None,property_images/pe3.jpeg,https://babilonia.pe/inmueble/casa-en-venta-en...,555000.0,Peru,None,None
6,24,"Los Alamos De Monterrico, Santiago De Surco, Lima",1200000,6000.00,house,La casa m√°s grande en Los √Ålamos de Monterrico...,2024-12-10 15:46:25.012200,5,17,luxury,...,familiar,None,4,None,property_images/pe4.jpeg,https://babilonia.pe/inmueble/casa-en-venta-en...,1200000.0,Peru,None,None
7,25,"Santa Paula, Caracas",78000,104.10,apartment,Acogedor apartamento en venta en Santa Paula e...,2024-12-10 15:51:20.172633,3,6,social,...,familiar,None,5,None,property_images/ve1.jpg,https://mercadopiso.com/property/apartamento-s...,78000.0,Venezuela,None,None
8,26,"La Boyera, Caracas",180000,570.00,house,Amplia casa en excelente urbanizacion con call...,2024-12-10 15:53:45.506500,5,15,social,...,familiar,None,5,None,property_images/ve2.jpg,https://mercadopiso.com/property/casa-la-boyer...,180000.0,Venezuela,None,None

In [1]:
class DatabaseViewer:
    def __init__(self, db_path):
        self.db_path = db_path
        self.conn = None
        self.cursor = None
    
    def connect(self):
        if not self.conn:
            self.conn = sqlite3.connect(self.db_path)
            self.cursor = self.conn.cursor()
    
    def execute_update_query(self, query):
        self.connect()  # Aseguramos que hay una conexi√≥n activa
        try:
            self.cursor.execute(query)
            self.conn.commit()
            return "Update executed successfully"
        except Exception as e:
            if self.conn:
                self.conn.rollback()
            return f"Update error: {str(e)}"
    
    def execute_custom_query(self, query):
        self.connect()  # Aseguramos que hay una conexi√≥n activa
        try:
            return pd.read_sql_query(query, self.conn)
        except Exception as e:
            return f"Query error: {str(e)}"
    
    def close(self):
        if self.conn:
            self.conn.close()
            self.conn = None
            self.cursor = None

# Uso
db_path = "../../chat-Interface/db.sqlite3"
viewer = DatabaseViewer(db_path)

In [4]:
# 	id	name	country_id
# 0	5	Rosario	5
# 1	6	Lima	4
# 2	7	Quindio	3
# 3	8	Antioqu√≠a	3
# 4	9	Capital Federal	2


# 	id	name	province_id
# 0	1	Recoleta	9
# 1	2	Palermo	9
# 2	3	Villa Urquiza	9
# 3	4	Envigado	8
# 4	5	Armenia	7

# 	id	name
# 0	1	Ciudad Autonoma de Buenos Aires
# 1	2	Argentina
# 2	3	Colombia
# 3	4	Peru
# 4	5	Venezuela

update_query = """

UPDATE chat_property
SET province_id = 8, city_id = 4
WHERE id = 20;
"""

#-----------------------------------

# UPDATE chat_property
# SET province_id = 9, city_id = 1
# WHERE id = 17;
# """

# UPDATE chat_property
# SET province_id = 9, city_id = 2
# WHERE id = 18;
# """

# UPDATE chat_property
# SET province_id = 9, city_id = 3
# WHERE id = 19;
# """



# UPDATE chat_property
# SET province_id = 7, city_id = 5
# WHERE id = 21;
# """

# UPDATE chat_property
# SET province_id = 6, city_id = 6
# WHERE id = 22;
# """

# UPDATE chat_property
# SET province_id = 6, city_id = 6
# WHERE id = 23;
# """

# UPDATE chat_property
# SET province_id = 6, city_id = 7
# WHERE id = 24;
# """

# UPDATE chat_property
# SET province_id = 10, city_id = 8
# WHERE id = 25;
# """

# UPDATE chat_property
# SET province_id = 10, city_id = 9
# WHERE id = 26;
# """

# Ver la estructura de las tablas
try:
    # Ejecutar el update
    result = viewer.execute_update_query(update_query)
    print(result)
    
    # # Verificar el resultado
    # verify_query = """
    # SELECT id, province_id, city_id 
    # FROM chat_property 
    # WHERE id = 17;
    # """
    # print("\nVerificaci√≥n del update:")
    # display(viewer.execute_custom_query(verify_query))

finally:
    viewer.close()

Update executed successfully